{
  "home": {
    "intro": "Sandy Lee, \nFull Stack Developer\n2 years Experience",
    "desc": "To deepen my knowledge in computer science and explore AI-driven solutions, \nI am now pursuing a master’s degree in the UK.",
    "msc": "Msc Computer Science \n@ University of Birmingham",
    "year": "2025-Present"
  },
  "about": {
    "intro": "I am a full-stack developer with two years of experience, primarily focused on front-end development using React and TypeScript. On the back end, I have worked with Java Spring Boot to design APIs and integrate databases, building stable and scalable services. I also have hands-on experience in cloud and automation, having designed CI/CD pipelines and set up deployment environments using AWS services and Docker.",
    "experience": {
      "ponylink": {
        "title": "Full Stack Developer @ Ponylink",
        "subtitle": "Onsite | October 2023 - August 2025",
        "desc": " • Frontend: Built responsive web applications using React, Next.js, and TypeScript, focusing on usability, performance, and maintainable code.\n• Backend: Developed and maintained backend services with Kotlin (Spring Boot) and Java, including API integrations, microservices, and CI/CD pipelines.\n• Cloud & DevOps: Managed deployments and infrastructure on AWS (EC2, EKS, S3) and implemented automated pipelines using Jenkins.\n                  • Prototyping & Internal Projects: Led and contributed to prototypes, including a real-time vehicle maintenance service (WebRTC/AWS Chime) and a microservices demo (RabbitMQ, Spring Gateway)."
      }
    },
    "education": {
      "uob": {
        "title": "University of Birmingham",
        "major": "Msc Computer Science",
        "date": "Sep 2025 -"
      },
      "snue": {
        "title": "Seoul National University of Education",
        "major": "Bachelor of Education - BEd, Elementary Education (Mathematics)",
        "date": "March 2018 - February 2022"
      }
    },
    "certificate": {
      "summary": "☁️ AWS Solutions Architect – Associate\nValidated ability to design cost-efficient, highly available, and fault-tolerant infrastructures. Strengthened cloud architecture and system design expertise.\n🗄️ SQLD (SQL Developer)\nCertified in database design, normalization, and SQL optimization. Enhanced capability to build reliable, data-driven applications.\n💻 Engineer Information Processing\nA national certification by HRD Korea, covering software engineering, databases, OS, and networks. Provided a strong foundation for systematic software development practices.\n🐧 Linux Master Level 2\nIssued by the KAIT. Learned Linux installation, user/permission management, process control, and shell scripting, building a foundation for server and cloud operations.",
      "aws": {
        "title": "AWS Solutions Architect Associate",
        "institute": "Amazon Web Service",
        "date": "May 2025",
        "desc": "• Learned how to design cost-efficient, highly available infrastructure that minimizes risks during failures\n• Gained a deeper understanding of cloud architecture through hands-on experience with multiple AWS services\n• Certified as an AWS Solution Architect – Associate, strengthening cloud and system design expertise"
      },
      "sqld": {
        "title": "SQL Developer",
        "institute": "Korea Data Agency",
        "date": "April 2025",
        "desc": "• Acquired SQL Developer (SQLD) certification issued by the Korea Data Agency\n• Strengthened expertise in database design, normalization, and SQL optimization\n• Gained practical skills for building reliable and efficient data-driven systems"
      },
      "eip": {
        "title": "Engineer of Information Processing",
        "institute": "HRD Korea",
        "date": "September 2025",
        "desc": "• A nationally accredited certification issued by the Human Resources Development Service of Korea (HRD Korea).\n• Covers a wide range of computer science domains, including software engineering, databases, operating systems, and computer networks.\n• Demonstrates the ability to apply fundamental computer science knowledge to practical development environments.\n• This certification provides a strong foundation for systematic software development practices and enhances professional credibility as a developer."
      },
      "linux": {
        "title": "Linux Master (Level 2)",
        "institute": "KAIT",
        "date": "October 2024",
        "desc": "• A certification issued by the Korea Association for ICT Promotion(KAIT), focused on fundamental Linux administration skills.\n• Learned essential topics such as Linux installation and configuration, user and permission management, process control, and basic shell scripting.\n• Strengthened the ability to manage and maintain secure and efficient Linux server environments, serving as a strong foundation for backend and cloud infrastructure operations."
      }
    }
  },
  "language": {
    "label": "Change language",
    "locale": "{locale, select, ko {🇰🇷 한국어} en {🇬🇧 English} other {Unknown}}"
  },
  "projects": {
    "acs": {
      "title": "Coupang Digital VI System – Apple Care Service (ACS)",
      "desc": "ACS (Apple Care Service) is a service that allows customers who purchase Apple devices on Coupang to pay for the existing one-time insurance product, Apple Care+, through a monthly subscription plan.\nThis reduces the initial cost burden and aims to attract more customers.\nThe service architecture is designed to be expandable beyond Apple Care+, enabling support for other device warranty and insurance products in the future.",
      "features": [
        "Digital product subscription management and term-based subscription tracking",
        "Registration and modification of payment methods for subscriptions",
        "Subscription cancellation and withdrawal processes",
        "Subscription status management via the admin page",
        "Multi-platform support: PC/Mobile Web, WebView",
        "Development and operation of API, interface, and batch processes"
      ],
      "role": [
        "Frontend Development: Implemented PC/Mobile Web and WebView UI (Next.js, React)",
        "BFF Server Maintenance & Testing: Conducted stability testing, bug fixes, issue resolution for external/internal service integrations, and performance monitoring of the existing Kotlin-based API server",
        "Operations/Deployment: Built monitoring environment (Grafana) and handled incident response",
        "Performance Optimization: Improved response times through caching and query optimization"
      ],
      "contributions": []
    },
    "crewcall": {
      "title": "LG U+ CrewCall (Group Call)",
      "desc": "A group calling app pre-installed on LG U+ smartphones, supporting up to 10 simultaneous participants and favorite group management for quick calls. In this project, I contributed to WebView backend development (Spring Boot, Java), implementation of authentication, terms agreement, and settings features, as well as CI/CD and deployment automation.",
      "features": [
        "Group calls with up to 10 participants",
        "Favorite group management and quick call initiation",
        "WebView-based experience within the mobile app",
        "User experience optimized for quick group calling"
      ],
      "role": [
        "Developed and implemented WebView backend (Spring Boot, Java) and UI",
        "Operated CI/CD pipelines and managed deployment processes",
        "Monitored and maintained service operation environments (K8s, Docker)"
      ],
      "contributions": [
        "Developed WebView backend (Spring Boot, Java): Implemented MVC architecture and rendered UI using Thymeleaf templates",
        "Managed CI/CD pipeline: Configured AWS-based automated build, test, and Docker deployment; monitored deployment status and handled rollback processes",
        "Implemented SMS authentication: Added phone number verification and authentication code generation/verification in the onboarding flow",
        "Terms & Policy Management: Delivered terms content dynamically via S3–CloudFront, implemented user consent validation logic, and integrated UI controls",
        "Logging & Analytics Instrumentation: Integrated with LG U+ internal logging system, collected and analyzed app entry, active user counts, and group call usage statistics",
        "K8s & Docker Operations: Managed container configurations, monitored runtime status, and responded to incidents"
      ]
    },
    "techSupport": {
      "title": "Real-time Automobile Tech Support Platform (Prototype)",
      "desc": "A prototype platform that enables workers in automobile maintenance sites to receive remote technical support through real-time video, audio, and chat. The system leverages AWS Chime (WebRTC) for live communication, Redis and PostgreSQL for session/matching management, and SSE for instant notifications to deliver a stable and interactive support experience.",
      "features": [
        "One-time login using nickname with session-based authentication",
        "1:1 automatic worker-supporter matching (FIFO queue based)",
        "Real-time video/audio/text chat via AWS Chime (WebRTC, Data Channel)",
        "Connection/session management using Redis with TTL-based auto-cleanup",
        "Persistent user, meeting, and matching data stored in PostgreSQL",
        "Server-Sent Events (SSE) for real-time request, acceptance, and termination notifications",
        "Jenkins pipeline for automated deployment of Spring Boot REST APIs"
      ],
      "role": [
        "Frontend Development: Developed React/TypeScript-based UI and API integrations",
        "Backend Development: Implemented Spring Boot REST APIs, AWS Chime integration, and SSE notification flow",
        "Infrastructure: Designed PostgreSQL schema and created Jenkins CI/CD pipeline"
      ],
      "contributions": [
        "Designed and implemented Spring Boot REST APIs and integrated AWS Chime SDK to provide real-time video, audio, and text chat",
        "Implemented termination flow with AWS DeleteMeeting API and DB cleanup logic to prevent unnecessary billing",
        "Designed PostgreSQL schema and implemented matching/meeting data management logic",
        "Built Jenkins pipeline to enable automated build, test, and deployment of the backend application",
        "Developed basic React/TypeScript UI for login, support request, and meeting room, and integrated with backend APIs"
      ]
    },
    "sensorDashboard": {
      "title": "Real-time Multi-modal Sensor Data Analytics Dashboard",
      "desc": "A full-stack analytics platform designed to efficiently query and visualize large-scale multi-modal sensor data stored in PostgreSQL. The system ensures high data reliability through Python-based preprocessing and features a scalable infrastructure managed as code with Terraform on GCP.",
      "features": [
        "Node-specific Data Filtering: Allows users to select specific Node IDs to isolate and visualize data from individual sensor devices.",
        "Customizable Time-range Queries: Features 'Quick Selection' buttons for preset intervals (Today, last 7 days, etc.) along with manual date-range pickers for flexible data exploration.",
        "Sensor Value Range Search: Provides granular filtering capabilities by allowing users to define specific value ranges for metrics such as temperature, humidity, and illumination.",
        "Multi-modal Data Visualization: Presents diverse sensor categories through intuitive charts and synchronized data tables for comprehensive monitoring.",
        "Automated Data Preprocessing: Utilizes Python (Pandas) to normalize Node IDs and clean raw sensor records for consistent database integrity.",
        "Secure Infrastructure Management: Implements Nginx reverse proxy with SSL encryption and domain-restricted CORS policies for safe cross-origin data communication.",
        "Infrastructure as Code (IaC): Managed GCP resources including VM instances and firewall rules using Terraform for reproducible environments."
      ],
      "role": [
        "Full-stack Development: Designed and implemented the RESTful API for complex data querying and the responsive dashboard UI.",
        "DevOps & Infrastructure: Built and managed the automated deployment pipeline using Docker Compose, GitHub Actions, and Docker Hub.",
        "Cloud Infrastructure Engineer: Provisioned and orchestrated cloud resources using Terraform to ensure infrastructure consistency."
      ],
      "contributions": [
        "Architected efficient SQL queries and Express.js API endpoints to handle multi-conditional filtering (Node ID, time range, and sensor value ranges).",
        "Enhanced user experience (UX) by implementing 'Quick Range' shortcut buttons for frequently used time intervals.",
        "Developed a high-performance visualization dashboard using Next.js and TypeScript that reacts instantly to complex filter changes.",
        "Provisioned GCP Compute Engine and network security groups via Terraform, eliminating manual configuration errors and ensuring 100% reproducibility.",
        "Strengthened system security by refactoring CORS settings to restrict API access exclusively to the production domain via environment variables.",
        "Integrated Certbot within a Docker container to automate SSL certificate issuance and 90-day renewal cycles."
      ],
      "troubleshooting": [
        "Optimized database query performance for large datasets by implementing efficient indexing strategies and server-side filtering logic.",
        "Resolved 'Mixed Content' and CORS blockers by configuring an Nginx reverse proxy to unify frontend and backend under a single SSL-secured domain.",
        "Eliminated synchronization issues between the build image and production server by establishing a 'Pull-based' deployment flow via Docker Hub."
      ]
    },
    "approvalWeb": {
      "title": "Internal Electronic Approval Web System",
      "desc": "Extended the existing app-based electronic approval system to the web. Implemented document review and approval/rejection, attachment handling, leave applications, and user settings. Leveraged existing Java REST APIs, and developed the entire frontend solo using React (Next.js) and TypeScript.",
      "features": [
        "View approval documents and approve/reject",
        "Upload and download document images and attachments",
        "Register and view comments on approval documents",
        "Submit leave applications, view status, and check remaining leave",
        "User settings: password change, delegate designation, e-signature registration/update",
        "Change email and app push notification preferences"
      ],
      "role": [
        "Frontend Development: Solo development of UI and logic using React (Next.js) + TypeScript",
        "API Integration: Integrated with existing Java REST APIs for data communication",
        "UX: Built user-friendly flows for attachments preview/upload and e-signature input"
      ],
      "contributions": [
        "Independently developed the web UI using Next.js and TypeScript",
        "Integrated with Java REST APIs (documents/leave/settings) with error/loading handling",
        "Implemented approval flows (approve/reject) and comments features",
        "Implemented attachments upload/preview/download",
        "Built leave application/status/remaining balance views",
        "Developed user settings pages (password, delegate, e-signature, notifications)"
      ]
    },
    "wishlist": {
      "title": "Wishlist Collage Web App",
      "desc": "A simple yet creative web application that allows users to add images and links of desired items, automatically remove their backgrounds, and generate a clean collage-style wishlist. Built with a FastAPI backend and React (Next.js) frontend, fully deployed using AWS (EC2, RDS, S3, CloudFront) and Vercel.",
      "features": [
        "Add desired items with images and links",
        "Automatic background removal using Python `rembg` library",
        "Upload and store processed images on AWS S3",
        "Store and manage item metadata in AWS RDS (PostgreSQL)",
        "View wishlist images through CloudFront for optimized delivery",
        "Responsive design for both PC and mobile"
      ],
      "role": [
        "Backend Development: Built and deployed a FastAPI backend server on AWS EC2 using Docker",
        "Database Design: Configured AWS RDS (PostgreSQL) to store item data and image metadata",
        "Frontend Development: Developed responsive web UI with React (Next.js)",
        "Cloud Integration: Configured AWS S3, CloudFront, and RDS for seamless backend integration",
        "DevOps: Managed EC2 instance setup, Docker containerization, and Vercel deployment"
      ],
      "contributions": [
        "Developed Python backend server using FastAPI for image background removal, metadata handling, and S3 integration",
        "Integrated `rembg` for background removal and optimized image size processing to improve EC2 memory efficiency",
        "Designed and implemented PostgreSQL schema in AWS RDS to manage wishlist items and image references",
        "Implemented S3 upload logic and CloudFront-based retrieval for fast image delivery",
        "Designed frontend wishlist interface and collage layout using Next.js",
        "Set up Dockerized backend deployment on EC2 and configured CORS / proxy settings for stable API communication",
        "Performed responsive UI testing on desktop and mobile devices"
      ],
      "troubleshooting": [
        "Fixed Out-of-Memory errors on EC2 caused by large image processing — optimized `rembg` usage and upgraded EC2 memory to 2GB",
        "Resolved mixed-content API errors (HTTPS frontend / HTTP backend) by configuring Next.js API proxy for secure communication",
        "Handled database connection pooling for AWS RDS to ensure stable performance under concurrent requests"
      ]
    }
  }
}
