{
  "home": {
    "intro": "Sandy Lee, \nFull Stack Developer\n2 years Experience",
    "desc": "To deepen my knowledge in computer science and explore AI-driven solutions, \nI am now pursuing a master’s degree in the UK.",
    "msc": "Msc Computer Science \n@ University of Birmingham",
    "year": "2025-Present"
  },
  "about": {
    "intro": "3년 차 풀스택 개발자로, React와 TypeScript 기반의 프론트엔드 개발을 주로 담당해왔습니다. 백엔드에서는 Java Spring Boot를 활용해 API 설계와 데이터베이스 연동을 수행하며, 안정적이고 확장 가능한 서비스를 구축했습니다. 또한 프로젝트에서 CI/CD 파이프라인을 설계하고 AWS 서비스와 Docker를 활용해 배포 환경을 구성하는 등, 클라우드와 자동화 분야에서도 실무 경험을 보유하고 있습니다.",
    "experience": {
      "ponylink": {
        "title": "Full Stack Developer @ Ponylink",
        "subtitle": "2023.10 - 2025.08",
        "desc": " • Frontend: React, Next.js, TypeScript로 반응형 웹 개발 \n(성능·유지보수성 중점)\n • Backend: Kotlin(Spring Boot), Java 기반 API 및 마이크로서비스 개발\n • Cloud & DevOps: AWS(EC2, EKS, S3), Docker, Jenkins 기반 배포·자동화"
      }
    },
    "education": {
      "uob": {
        "title": "University of Birmingham",
        "major": "Msc Computer Science",
        "date": "2025.09 -"
      },
      "snue": {
        "title": "서울교육대학교",
        "major": "교육학 학사 - 초등교육 수학심화전공",
        "date": "2018.03 - 2022.02"
      }
    },
    "certificate": {
      "summary": "☁️ AWS Solutions Architect – Associate\nValidated ability to design cost-efficient, highly available, and fault-tolerant infrastructures. Strengthened cloud architecture and system design expertise.\n🗄️ SQLD (SQL Developer)\nCertified in database design, normalization, and SQL optimization. Enhanced capability to build reliable, data-driven applications.\n💻 Engineer Information Processing\nA national certification by HRD Korea, covering software engineering, databases, OS, and networks. Provided a strong foundation for systematic software development practices.\n🐧 Linux Master Level 2\nIssued by the KAIT. Learned Linux installation, user/permission management, process control, and shell scripting, building a foundation for server and cloud operations.",
      "aws": {
        "title": "AWS Solution Architect Associate",
        "institute": "Amazon Web Service",
        "date": "2025.05",
        "desc": "• 비용 효율적이고 장애 발생 시 위험을 최소화하는 고가용성 인프라 설계 경험\n• 다양한 AWS 서비스를 활용하며 클라우드 아키텍처 전반에 대한 이해 심화\n• AWS Solution Architect – Associate 자격 취득을 통해 클라우드 및 시스템 설계 역량 강화"
      },
      "sqld": {
        "title": "SQLD",
        "institute": "한국데이터산업진흥원",
        "date": "2025.04",
        "desc": "• 한국데이터산업진흥원에서 발급하는 SQL 개발자(SQLD) 자격 취득\n• 데이터베이스 설계, 정규화, SQL 최적화에 대한 전문성 강화\n• 안정적이고 효율적인 데이터 기반 시스템 구축 역량 확보"
      },
      "eip": {
        "title": "정보처리기사",
        "institute": "한국산업인력공단",
        "date": "2025.09",
        "desc": "• 자격 준비 과정을 통해 소프트웨어 공학적 문제 해결 방식을 익히고, 데이터베이스·운영체제·네트워크 등 컴퓨터공학 핵심 개념을 체계적으로 학습.\n• 체계적인 개발 프로세스에 대한 이해를 확보.\n• 대규모 시스템을 안정적으로 설계·운영할 수 있는 기초 역량을 갖추게 되었으며, 개발자로서 전문성을 강화하는 계기가 됨."
      },
      "linux": {
        "title": "리눅스마스터 2급",
        "institute": "KAIT",
        "date": "2024.10",
        "desc": "• 리눅스 운영체제 기초 자격 학습을 통해 리눅스 설치 및 환경 설정, 사용자 및 권한 관리, 프로세스 제어, 기본 쉘 스크립트 작성 등의 핵심 관리 능력을 습득.\n• 이를 기반으로 서버 환경을 안정적이고 효율적으로 운영할 수 있는 기초 역량을 확보하였으며,\n• 백엔드 개발과 클라우드 인프라 관리의 기반 지식을 다지는 계기가 됨."
      }
    }
  },
  "language": {
    "label": "언어 변경",
    "locale": "{locale, select, ko {🇰🇷 한국어} en {🇬🇧 English} other {Unknown}}"
  },
  "projects": {
    "acs": {
      "title": "쿠팡 Digital VI 시스템 – Apple Care Service (ACS)",
      "desc": "ACS(Apple Care Service)는 쿠팡에서 애플 디바이스를 구매하는 고객이 기존의 일시불 보험 상품 Apple Care+를 월정액 구독 방식으로 결제할 수 있도록 지원하는 서비스입니다.\n이를 통해 초기 비용 부담을 줄이고, 더 많은 고객 유입을 유도하는 것을 목표로 했습니다.\n서비스 구조는 Apple Care+에 국한되지 않고, 향후 다른 디바이스 보증·보험 상품군에도 확장 가능하도록 설계되었습니다.",
      "features": [
        "디지털 상품 신청 및 기간 구독 관리",
        "구독 결제 정보 등록/변경",
        "구독 해지 및 철회 프로세스",
        "관리자 페이지를 통한 구독 상태 관리",
        "다중 플랫폼 지원: PC/Mobile Web, WebView",
        "API, Interface, Batch 프로세스 개발 및 운영"
      ],
      "role": [
        "Frontend 개발: PC/Mobile Web, WebView UI 구현 (Next.js, React)",
        "BFF 서버 유지보수 및 테스트: 기존 Kotlin 기반 API 서버의 안정성 테스트, 버그 수정, 외부/내부 서비스 연동 이슈 대응 및 성능 모니터링",
        "운영/배포: 모니터링 환경 구축(Grafana), 장애 대응",
        "성능 최적화: 캐싱 및 쿼리 최적화를 통한 응답 속도 개선"
      ],
      "contributions": []
    },
    "crewcall": {
      "title": "LG U+ 크루콜 (그룹 통화 서비스)",
      "desc": "LG U+ 스마트폰에 기본 탑재되는 그룹 통화 앱으로, 최대 10명 동시 통화와 즐겨찾기 그룹 관리 기능을 제공합니다. 본 프로젝트에서는 웹뷰 백엔드(Spring Boot, Java) 개발, 인증·약관 동의·설정 기능 구현, CI/CD 및 배포 운영 자동화에 기여했습니다.",
      "features": [
        "최대 10명 동시 그룹 통화",
        "즐겨찾기 그룹 관리 및 빠른 호출",
        "모바일 앱 내 웹뷰 기반 경험",
        "간편한 그룹 호출 중심 UX"
      ],
      "role": [
        "웹뷰 백엔드 개발(Spring Boot, Java) 및 UI 구현",
        "CI/CD 파이프라인 운영 및 배포 프로세스 관리",
        "서비스 운영 환경(K8s·Docker) 모니터링 및 유지보수"
      ],
      "contributions": [
        "웹뷰 백엔드(Spring Boot, Java) 개발: MVC 구조 기반, Thymeleaf 템플릿으로 UI 렌더링",
        "CI/CD 파이프라인 운영: AWS 기반 빌드·테스트·도커 배포 자동화 구성, 배포 상태 모니터링 및 롤백 프로세스 관리",
        "SMS 인증 기능 구현: 가입 플로우 내 휴대폰 번호 검증 및 인증 코드 발송·검증 로직 개발",
        "약관·정책 관리: S3–CloudFront를 통한 약관 콘텐츠 동적 제공, 사용자 동의 상태 검증 로직 및 UI 제어 구현",
        "로그·분석 계측: U+ 내부 로깅 연동, 앱 진입·활성 사용자·그룹 통화 이용 현황 집계 및 분석 데이터 제공",
        "K8s·Docker 환경 운영: 컨테이너 설정 관리, 런타임 상태 모니터링 및 장애 대응"
      ]
    },
    "techSupport": {
      "title": "실시간 차량 정비 서포트 플랫폼 (Prototype)",
      "desc": "자동차 정비 현장에서 작업자가 원격 기술 지원을 받을 수 있도록 실시간 영상/음성/채팅을 제공하는 프로토타입 플랫폼입니다. AWS Chime 기반 WebRTC를 통해 정밀한 원격 정비 지원이 가능하며, Redis와 PostgreSQL을 활용한 매칭/세션 관리, SSE 기반 알림 시스템을 통해 안정적인 사용자 경험을 구현했습니다.",
      "features": [
        "닉네임 기반 일회성 로그인",
        "작업자-서포터 간 1:1 자동 매칭 (FIFO 큐 기반)",
        "AWS Chime(WebRTC) 영상/음성/채팅 지원 (Data Channel 활용)",
        "Redis를 이용한 사용자 접속/연결 상태 관리 및 TTL 기반 자동 정리",
        "PostgreSQL 기반 사용자/미팅/매칭 정보 저장",
        "SSE(Server-Sent Events)를 통한 실시간 요청·수락·종료 알림",
        "Jenkins 기반 Spring Boot REST API 배포 파이프라인 구축"
      ],
      "role": [
        "Frontend Development: React/TypeScript 기반 UI 및 API 연동 개발",
        "Backend Development: Spring Boot REST API 구현, AWS Chime 연동, SSE 알림 처리",
        "Infrastructure: PostgreSQL 스키마 설계 및 Jenkins 파이프라인 작성"
      ],
      "contributions": [
        "Spring Boot 기반 REST API를 설계 및 구현하고, AWS Chime SDK를 연동하여 실시간 영상/음성/텍스트 채팅 기능을 제공",
        "회의 종료 시 AWS DeleteMeeting API 호출 및 DB 정리 로직을 구현하여 불필요한 비용 발생을 방지",
        "PostgreSQL 스키마 설계 및 매칭/미팅 데이터 관리 로직 구현",
        "Jenkins 파이프라인을 구축하여 백엔드 애플리케이션의 자동 빌드·테스트·배포 환경을 마련",
        "React/TypeScript 기반으로 기본적인 로그인/요청/미팅룸 UI를 구현하고 백엔드 API와 연동"
      ]
    },
    "sensorDashboard": {
      "title": "실시간 멀티모달 센서 데이터 분석 대시보드",
      "desc": "PostgreSQL에 저장된 대규모 멀티모달 센서 데이터를 효율적으로 조회하고 분석할 수 있는 풀스택 모니터링 플랫폼입니다. Terraform을 이용한 IaC 구축과 Docker 기반의 인프라 운영을 통해 데이터 분석 환경의 신뢰성을 확보했습니다.",
      "features": [
        "노드(Node ID)별 데이터 필터링: 특정 센서 노드를 선택하여 해당 장치의 데이터만 선별적으로 시각화",
        "맞춤형 기간 검색: 퀵 버튼(단축키)을 이용한 간편 기간 설정(오늘, 최근 7일 등) 및 사용자 정의 기간 데이터 조회",
        "센서별 범위 검색: 온도, 습도, 조도 등 각 센서 타입별로 특정 수치 범위를 지정하여 세부 데이터 필터링",
        "멀티모달 시각화: 다양한 종류의 센서 데이터를 차트와 테이블 형식을 통해 직관적인 대시보드 형태로 제공",
        "데이터 전처리 자동화: Python(Pandas)을 활용해 수집된 원천 데이터의 노드 ID 정규화 및 정제 프로세스 구현",
        "보안 인프라 구축: Nginx 리버스 프록시와 SSL 인증 및 도메인 기반 CORS 정책을 통한 안전한 데이터 통신"
      ],
      "role": [
        "Full-stack Development: 데이터 조회용 REST API 개발 및 필터링 기능이 포함된 대시보드 UI 구현",
        "DevOps: Docker Compose와 GitHub Actions를 이용한 자동화된 배포 환경 구축",
        "Cloud Infrastructure Engineer: Terraform을 이용한 GCP 리소스 자동 프로비저닝"
      ],
      "contributions": [
        "다양한 검색 조건(Node ID, 기간, 센서 범위)을 처리할 수 있는 효율적인 DB 쿼리 및 Express API 설계",
        "사용자 경험(UX) 개선을 위해 빈번하게 사용하는 기간 설정을 퀵 버튼 형태의 단축 UI로 구현",
        "Next.js와 TypeScript를 사용하여 데이터 필터링 시 즉각적으로 반응하는 고성능 시각화 대시보드 개발",
        "기존의 무분별한 CORS 허용 정책을 특정 도메인으로 제한하도록 리팩토링하여 보안성 강화",
        "Terraform을 통해 클라우드 리소스를 코드로 관리하여 인프라 설정의 일관성과 재현성 확보"
      ],
      "troubleshooting": [
        "센서별 범위 검색 및 대량 데이터 조회 시 발생하는 쿼리 성능 문제를 인덱싱 및 필터 로직 최적화로 해결",
        "Mixed Content 및 교차 출처 에러 방지를 위해 Nginx를 활용한 통합 인증 및 프록시 환경 구축",
        "배포된 이미지와 서버 상태의 불일치 문제를 Docker Hub 기반의 Pull 배포 자동화로 해결"
      ]
    },
    "approvalWeb": {
      "title": "사내 전자결재 웹 버전",
      "desc": "기존 앱 기반 전자결재 시스템을 웹 환경으로 확장한 프로젝트입니다. 결재 문서 조회 및 승인/반려, 첨부파일 관리, 휴가 신청과 사용자 설정 등을 웹에서도 사용할 수 있도록 구현했습니다. 기존 Java REST API를 연동했고, 프론트엔드는 React(Next.js)와 TypeScript로 단독 개발했습니다.",
      "features": [
        "결재 문서 조회 및 승인/반려",
        "문서 이미지 및 첨부파일 업로드/다운로드",
        "결재 문서별 코멘트 등록 및 조회",
        "휴가 신청, 신청 현황 조회, 잔여 휴가 확인",
        "사용자 설정: 비밀번호 변경, 대결자 지정, 전자 서명 등록/수정",
        "메일 및 앱푸시 알림 설정 변경"
      ],
      "role": [
        "Frontend Development: React(Next.js) + TypeScript 기반 UI 및 로직 단독 개발",
        "API Integration: 기존 Java REST API와 연동하여 데이터 통신 처리",
        "UX: 첨부파일 업로드/미리보기, 전자 서명 입력 등 사용자 친화적 UI 설계/구현"
      ],
      "contributions": [
        "Next.js + TypeScript 기반 전자결재 웹 UI 단독 개발",
        "Java REST API 연동(문서/휴가/설정 도메인) 및 에러/로딩 상태 처리",
        "결재 승인/반려 플로우와 코멘트 등록/조회 기능 구현",
        "첨부파일 업로드/미리보기/다운로드 기능 구현",
        "휴가 신청, 신청 현황, 잔여 휴가 확인 UI 개발",
        "사용자 설정(비밀번호, 대결자, 전자 서명, 알림) 화면 개발"
      ]
    },
    "wishlist": {
      "title": "위시리스트 콜라주 웹 앱",
      "desc": "사용자가 원하는 아이템의 이미지와 링크를 추가하면 배경을 자동으로 제거하고, 깔끔한 콜라주 형태의 위시리스트를 만들어주는 간단하고 창의적인 웹 애플리케이션입니다. FastAPI 기반의 백엔드와 React(Next.js) 기반의 프론트엔드로 구성되었으며, AWS(EC2, RDS, S3, CloudFront)와 Vercel을 활용해 클라우드 환경에서 완전하게 배포했습니다.",
      "features": [
        "원하는 아이템의 이미지와 링크 추가",
        "Python `rembg` 라이브러리를 활용한 자동 배경 제거",
        "처리된 이미지를 AWS S3에 업로드 및 저장",
        "AWS RDS(PostgreSQL)에 아이템 메타데이터 저장 및 관리",
        "CloudFront를 통한 최적화된 이미지 로딩",
        "PC와 모바일 모두에서 반응형 UI 지원"
      ],
      "role": [
        "백엔드 개발: FastAPI로 서버를 구현하고 Docker 기반으로 AWS EC2에 배포",
        "데이터베이스 설계: AWS RDS(PostgreSQL)를 구성하여 아이템 데이터 및 이미지 메타데이터 저장",
        "프론트엔드 개발: React(Next.js)로 반응형 웹 UI 제작",
        "클라우드 통합: AWS S3, CloudFront, RDS를 연동하여 안정적인 데이터 및 이미지 관리 구현",
        "DevOps: EC2 인스턴스 설정, Docker 컨테이너화, Vercel을 통한 프론트엔드 배포 관리"
      ],
      "contributions": [
        "FastAPI 기반 Python 백엔드 서버를 개발하여 이미지 배경 제거, 메타데이터 처리 및 S3 연동 기능 구현",
        "`rembg` 라이브러리를 통합해 배경 제거 기능을 제공하고, 이미지 크기 최적화를 통해 메모리 효율 개선",
        "AWS RDS(PostgreSQL)에 위시리스트 아이템 및 이미지 참조를 저장하기 위한 데이터베이스 스키마 설계 및 구현",
        "AWS S3 업로드 로직과 CloudFront 연동을 통해 빠르고 안정적인 이미지 로딩 구현",
        "Next.js 기반으로 위시리스트 인터페이스 및 콜라주 레이아웃 UI 설계",
        "Docker 환경에서 EC2 배포 및 CORS, 프록시 설정을 통해 안정적인 API 통신 구성",
        "데스크톱 및 모바일 환경에서 반응형 UI 테스트 수행"
      ],
      "troubleshooting": [
        "대용량 이미지 처리 시 EC2 메모리 부족(Out-of-Memory)으로 Docker 프로세스가 종료되는 문제 해결 — `rembg` 처리 방식을 최적화하고 EC2 메모리를 2GB로 확장하여 안정화",
        "Vercel 프론트엔드(HTTPS)와 EC2 백엔드(HTTP) 간 혼합 콘텐츠 문제로 발생한 API 오류를 Next.js API 프록시 설정으로 해결",
        "AWS RDS에서 동시 요청 시 안정성을 확보하기 위해 데이터베이스 커넥션 풀링(Connection Pooling) 구성"
      ]
    }
  }
}
